package com.company;

public class Main {

    public static void main(String[] args) {
	/*
	Вариант 1
    2.	Реализовать многопоточное приложение “Робот”.
        Надо написать робота, который умеет ходить.
        За движение каждой его ноги отвечает отдельный поток.
        Шаг выражается в выводе в консоль LEFT или RIGHT.
    3.	Реализовать многопоточное приложение “Магазин”.
        Вся цепочка: производитель-магазин-покупатель.
        Пока производитель не поставит на склад продукт, покупатель не может его забрать.
        Реализовать приход товара от производителя в магазин случайным числом.
        В том случае, если товара в магазине не хватает– вывести сообщение.
	 */

        System.out.println("------------------------------");
        System.out.println("№ 2");
        Robot robot1 = new Robot();
        //robot1.run();

        System.out.println("------------------------------");
        System.out.println("№ 3");
        Shop shop1 = new Shop();










    }
}

