package com.company;
import java.util.Scanner;
import java.util.Calendar;
import java.util.GregorianCalendar;

public class Main {

    public static void main(String[] args) {
        // Малкина Т.А. Вариант 11
        //Лаб1 Вариант 1
        /* 5. Создать программу ввода целых чисел как аргументов командной строки,
        подсчета их суммы (произведения) и вывода результата на консоль.*/
        Scanner in = new Scanner(System.in);
        System.out.println("------------------------------");
        System.out.println("Вариант 1, задание 5");
        System.out.print("Введите количество чисел, участвующих в операции:");
        int all = in.nextInt();
        int[] arg = new int[all];
        int sum = 0;
        int pro = 1;
        for (int i = 0; i < all; i++) {
            System.out.print("Введите значение " + i + " аргумента: ");
            arg[i] = in.nextInt();
            sum += arg[i];
            pro *= arg[i];
        }
        System.out.println("Сумма введенных чисел - " + sum);
        System.out.println("Произведение введенных чисел - " + pro);
        /* 6. Создать приложение, выводящее фамилию разработчика, дату и время получения задания,
        а также дату и время сдачи задания. Для получения последней даты и времени
        использовать класс Calendar из пакета java.util */
        System.out.println("------------------------------");
        System.out.println("Вариант 1, задание 6");
        String fam = "Малкина";
        Calendar date2 = new GregorianCalendar();
        Calendar date1 = new GregorianCalendar(2022, 02, 11, 10, 15);
        System.out.println("Разработчик " + fam + " получил задание :" + date1.getTime());
        System.out.println("Разработчик " + fam + " сдал задание :" + date2.getTime());



        /*Лаб1 Вариант 2
        Ввести с консоли n целых чисел и поместить их в массив. На консоль вывести:
        11. “Счастливые” числа.
        12. Числа Фибоначчи: f0 = f1 = 1, f (n) = f (n–1) + f (n–2). */
        System.out.println("------------------------------");
        System.out.println("Вариант 2, задание 11");
        System.out.print("Введите количество чисел, участвующих в операции:");
        int all11 = in.nextInt();
        int[] num = new int[all11];
        int[] kolvo = new int[all11];
        String str;
        for (int i = 0; i < all11; i++) {
            System.out.print("Введите значение " + i + " числа: ");
            num[i] = in.nextInt();
            str = Integer.toString(num[i]);
            kolvo[i] = str.length();
        }
        /*Счастливое число— число, определённое следующим процессом:
        начиная с любого положительного целого числа, мы заменяем это число
        суммой квадратов его цифр в десятичной системе счисления и повторяем данный процесс,
        пока число либо не станет равно 1 (где весь процесс остановится), или попадёт в бесконечный цикл, не содержащий 1
         Первые 143 счастливых числа до 1000:
         1, 7, 10, 13, 19, 23, 28, 31, 32, 44, 49, 68, 70, 79, 82, 86, 91, 94, 97, 100, 103, 109, 129, 130, 133, 139, 167,
         176, 188, 190, 192, 193, 203, 208, 219, 226, 230, 236, 239, 262, 263, 280, 291, 293, 301, 302, 310, 313, 319, 320,
         326, 329, 331, 338, 356, 362, 365, 367, 368, 376, 379, 383, 386, 391, 392, 397, 404, 409, 440, 446, 464, 469, 478,
         487, 490, 496, 536, 556, 563, 565, 566, 608, 617, 622, 623, 632, 635, 637, 638, 644, 649, 653, 655, 656, 665, 671,
         673, 680, 683, 694, 700, 709, 716, 736, 739, 748, 761, 763, 784, 790, 793, 802, 806, 818, 820, 833, 836, 847, 860,
         863, 874, 881, 888, 899, 901, 904, 907, 910, 912, 913, 921, 923, 931, 932, 937, 940, 946, 964, 970, 973, 989, 998, 1000
         */
        for (int i = 0; i < all11; i++) {
            int sq = 0;
            int j = 0;
            int a = num[i];
            int b = kolvo[i];
            String str_trash;
            do {
                switch (b) {
                    case 2:
                        sq = (((a / 10) % 10) * ((a / 10) % 10)) + ((a % 10) * (a % 10));
                        break;
                    case 3:
                        sq = ((a / 100) % 10) * ((a / 100) % 10) + (((a / 10) % 10) * ((a / 10) % 10)) + ((a % 10) * (a % 10));
                        break;
                    case 4:
                        sq = (a / 1000) * (a / 1000) + ((a / 100) % 10) * ((a / 100) % 10) + (((a / 10) % 10) * ((a / 10) % 10)) + ((a % 10) * (a % 10));
                        break;
                    case 1:
                        sq = a * a;
                }
                if (sq == 1) {
                    System.out.println("Счастливое число - " + num[i]);
                    j = 1;
                }
                else{
                    a = sq;
                    str_trash = Integer.toString(a);
                    b = str_trash.length();
                    if (b ==1){
                        break;
                    }
                }
            }
            while (j == 0) ;
        }
        System.out.println("------------------------------");
        System.out.println("Вариант 2, задание 12");
        System.out.print("Введите количество чисел, участвующих в операции:");
        int all12 = in.nextInt();
        int[] num12 = new int[all12];
        int[] fibon = new int[]{0, 1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89, 144, 233, 377, 610, 987, 1597, 2584, 4181, 6765, 10946, 17711};
        for (int i = 0; i < all12; i++) {
            System.out.print("Введите значение " + i + " числа: ");
            num12[i] = in.nextInt();
        }
        /*
        Числа Фибоначчи: 0, 1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89, 144, 233, 377, 610, 987, 1597, 2584, 4181, 6765, 10946, 17711
         */
        for (int i = 0; i < all12; i++) {
            for (int q = 0; q < 23; q++){
                if (num12[i] == fibon[q]){
                    System.out.println("Число Фибоначчи - " + num12[i]);
                }
            }

        }
        System.out.println("------------------------------");
        System.out.println("The end." );
        in.close();
    }
}
